## Plan result
[Build details](https://github.com/yuya-takeyama/terraform-modules/actions/runs/1085498167)
<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository.readonly-poly-repo[&#34;baz&#34;]
<details>
<summary>Command output</summary>


```
github_repository.readonly-poly-repo["foo"]: Refreshing state... [id=terraform-module-foo]
github_repository.readonly-poly-repo["bar"]: Refreshing state... [id=terraform-module-bar]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.readonly-poly-repo["bar"] has been changed
  ~ resource "github_repository" "readonly-poly-repo" {
      ~ etag                   = "W/\"77c6dd660ebaf03bb9c48b577cecfa17d7ab9d11dc23620c22c2b3a61ee488af\"" -> "W/\"2f847966167a34904d565d7a779137bc192ccc4aea75c58083e054dbabc6f556\""
        id                     = "terraform-module-bar"
        name                   = "terraform-module-bar"
        # (25 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.readonly-poly-repo["baz"] will be created
  + resource "github_repository" "readonly-poly-repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository is read only"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-module-baz"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>


<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":14,"Program":"tfcmt","SHA1":"2f1b3196802ebf5fb6bc8edc5ef5bb8ba26c71cc","Vars":{},"WorkflowName":"test"} -->